---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCollection.GetPointIterator
source: html/5b8babd9-cef5-c666-ddb0-7e048e2a8a19.htm
---
# Autodesk.Revit.DB.PointClouds.PointCollection.GetPointIterator Method

Creates and returns an iterator for the points contained in this collection.

## Syntax (C#)
```csharp
public PointIterator GetPointIterator()
```

## Returns
New iterator created, make sure to call 'free' on it when finished using it.